Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Modifiers that alter the way a regular expression is used by Perl are detailed in L<perlop/"Regexp Quote-Like Operators"> and L<perlop/"Gory details of parsing quoted constructs">.
es: Los modificadores que cambian la forma en que Perl usa una expresión regular se describen en L<perlop/"Operadores de entrecomillado para expresiones regulares"> y en L<perlop/"Detalles complejos del análisis de construcciones entrecomilladas">.

source: Module names are also capitalized unless they're functioning as pragmas; pragmas are in effect compiler directives, and are sometimes called "pragmatic modules" (or even "pragmata" if you're a classicist).
es: Para los nombres de los módulos se utiliza mayúscula inicial en cada palabra, a no ser que funcionen como pragmas (que en realidad son directivas del compilador, y a veces se denominan "módulos pragmáticos" o incluso "pragmata", si lo suyo es el latín).

source: Modules which can be released on cpan are known as "dual-life" modules.
es: Los módulos que se pueden publicar en CPAN se denominan módulos de «evolución dual».

source: Modules following this convention all play nicely with each other.
es: Los módulos que sigan esta convención no provocarán conflictos.

source: Modules shipped as part of the Perl core live in four subdirectories.
es: Los módulos distribuidos como parte del núcleo de Perl se encuentran en cuatro subdirectorios.

source: More generally, any experimental option that can be compiled into Perl, such as multithreading.
es: De manera más general, cualquier opción experimental que se pueda compilar en Perl, como la compatibilidad con múltiples hilos de ejecución.

source: More complex data types can be constructed using references, which allow you to build lists and hashes within lists and hashes.
es: Se pueden crear tipos de datos más complejos mediante referencias, que permiten generar listas y hashes dentro de listas y hashes.

source: More detail on each of the modifiers follows.
es: A continuación se ofrecen más detalles sobre cada uno de los modificadores.

source: More detailed information about Perl syntax can be found in L<perlsyn>.
es: Encontrará información más detallada sobre la sintaxis de Perl en L<perlsyn>.

source: More information about rebasing can be found in the documentation for the git-rebase(1) command.
es: Encontrará más información sobre la reorganización en la documentación del comando git-rebase(1).

source: More information can be found at: L<http://www.osdc.com.au/> for Australia, L<http://www.osdc.org.il> for Israel, and L<http://www.osdc.fr/> for France.
es: Encontrará más información en: L<http://www.osdc.com.au/> (Australia), L<http://www.osdc.org.il> (Israel) y L<http://www.osdc.fr/> (Francia).

source: More loosely, anything you type to a shell (a command interpreter) that starts it doing something.
es: También se puede definir de forma más informal como cualquier cosa que, al escribirse en una shell (un intérprete de comandos), hace que esta inicie alguna acción.

source: Moreover, these internal optimizations are not always applicable.
es: Por otra parte, estas optimizaciones internas no siempre son aplicables.

source: Most utilities (like perldoc) are in this category, i.e. patch F<utils/perldoc.PL> rather than F<utils/perldoc>.
es: La mayoría de las utilidades (como perldoc) pertenecen a esta categoría; es decir, debe aplicar un parche a F<utils/perldoc.PL> en lugar de aplicárselo a F<utils/perldoc>.

source: Most Perl classes use C<new> as the name for their constructor:
es: La mayoría de las clases Perl usan C<new> como nombre del constructor:

source: Most Perl-related channels will be kind enough to point you in the right direction if you ask nicely.
es: En la mayoría de los canales vinculados con Perl encontrará gente amistosa que le indicará un camino a seguir, si lo pide amablemente.

source: Most Perl-related projects set up mailing lists for both users and contributors.
es: La mayoría de los proyectos relacionados con Perl tienen configuradas listas de correo para los usuarios y contribuyentes.

source: Most Unix systems have dynamic linking.
es: La mayoría de los sistemas Unix disponen de vinculación dinámica.

source: Most likely you want both of them to use locale rules.
es: Lo más probable es que desee que ambas operaciones usen las reglas de la configuración regional.

source: Most likely you don't need to know this detail for C</l>, C</u>, and C</d>, and can skip ahead to L<E<sol>a|/E<sol>a (and E<sol>aa)>.
es: Lo más probable es que no necesite conocer estos detalles para C</l>, C</u> y C</d>, por lo que puede pasar directamente a L<E<sol>a|/E<sol>a (y E<sol>aa)>.

source: Most mailing lists are archived at L<http://nntp.perl.org/>.
es: La mayoría de las listas de correo se archivan en L<http://nntp.perl.org/>.

source: Most methods you write will expect to operate on objects:
es: La mayoría de los métodos que escriba operarán sobre objetos:

source: Most notably, it doesn't support any sort of attribute declaration, so you have to do that by hand.
es: En particular, no admite ningún tipo de declaración de atributo, por lo que tendrá que declararlos a mano.

source: Most object systems share a number of common concepts.
es: La mayoría de los sistemas orientados a objetos comparten una serie de conceptos comunes.

source: Most of the time, though, you'll want to be dealing with SVs internally instead of raw C<char *> strings:
es: Sin embargo, generalmente deseará manipular valores SV internamente, en lugar de manipular cadenas C<char *> sin procesar:

source: Most of these are small stand-alone modules, a number of which have been spun off from C<Moose>.
es: La mayoría son módulos independientes, algunos generados a partir de C<Moose>.

source: Most of these books are available online through Safari Books Online ( http://safaribooksonline.com/ ).
es: La mayoría de estos libros están disponibles en línea a través de Safari Books Online ( http://safaribooksonline.com/ ).

source: Most other approaches are doomed to failure.
es: La probabilidad de éxito de las demás opciones es baja.

source: Most people do this once globally in their F<~/.gitconfig> by doing something like:
es: La mayor parte de los usuarios hacen esto una sola vez en el archivo F<~/.gitconfig>, con comandos similares a los siguientes:

source: Most subroutines do not need to bother, though.
es: Sin embargo, no es necesario para la mayoría de las subrutinas.

source: Most tasks only require a small subset of the Perl language.
es: La mayoría de las tareas solo requieren conocer un pequeño subconjunto del lenguaje Perl.

source: Most text file processing can be done a line at a time with Perl's looping constructs.
es: Gran parte de las tareas de procesamiento de archivos de texto se puede hacer de línea en línea con las estructuras de bucle de Perl.

source: Much older code also uses the L<base> pragma.
es: En el código realmente antiguo también se usaba el pragma L<base>.

source: Multi-number v-strings like C<v65.66> and C<65.66.67> continue to be v-strings always.
es: Las v-strings con varios números, como C<v65.66> y C<65.66.67>, siguen siendo v-strings.

source: Multidimensional arrays may be emulated by subscripting a hash with a list.
es: Puede emular matrices multidimensionales utilizando listas como subíndices de un hash.

source: Multiple inheritance often indicates a design problem, but Perl always gives you enough rope to hang yourself with if you ask for it.
es: La herencia múltiple suele indicar un problema de diseño, pero Perl siempre le dará cuerda suficiente como para ahorcarse, si es lo que desea.

source: Must be willing to play the part of the Great Pumpkin now and then.
es: Debe estar dispuesto a representar el papel de la Gran Calabaza cada cierto tiempo.

source: Mustn't forget to change the number of tests which appears at the top, or else the automated tester will get confused.
es: No hay que olvidarse de actualizar el número de pruebas especificado al principio del código, para que el programa de ejecución automática de pruebas no se confunda.

source: NOTE: This section presents an abstract approximation of regular expression behavior.
es: NOTA: en esta sección se presenta una aproximación abstracta del comportamiento de las expresiones regulares.

source: NV also means an internal floating-point Numeric Value of the type a L</scalar> can hold, not to be confused with an L</IV>.
es: NV también es un valor numérico (Numeric Value) de punto flotante interno del tipo que un L</escalar> puede contener; no se debe confundir con un L</IV>.

source: Name of the MRO, either in ISO-8859-1 or UTF-8.
es: Nombre del orden de resolución de métodos, codificado en ISO-8859-1 o UTF-8.

source: Named after some similar languages spoken (for similar reasons) between compilers and interpreters in the late 20th century.
es: El nombre proviene de algunos lenguajes similares hablados (por razones parecidas) entre compiladores e intérpretes a finales del siglo XX.

source: Named backreference.
es: Retrorreferencia con nombre.

source: Named captures are implemented as being aliases to numbered groups holding the captures, and that interferes with the implementation of the branch reset pattern.
es: Las capturas con nombre se implementan como alias de los grupos numerados que almacenan las capturas, y esto interfiere con la implementación del patrón de reinicio de rama.

source: Named groups count in absolute and relative numbering, and so can also be referred to by those numbers.
es: Los grupos con nombre se numeran de forma absoluta y relativa, por lo que también se puede hacer referencia a ellos con esos números.

source: Names that do not start with a letter, underscore, digit or a caret (i.e. a control character) are limited to one character, e.g., C<$%> or C<$$>.
es: Los nombres que no empiecen por una letra, un guión bajo, un dígito o el símbolo de intercalación "^" (es decir, un carácter de control) están limitados a un solo carácter, como por ejemplo C<$%> o C<$$>

source: Names that start with a letter or underscore may also contain digits and underscores.
es: Los nombres que empiezan por una letra o un guión bajo pueden incluir también dígitos y otros guiones bajos.

source: Names that start with a digit may contain only more digits.
es: Los nombres que comienzan con un dígito solo pueden contener otros dígitos.

source: Needless to say, heuristics can produce very surprising results!
es: Huelga decir que la heurística puede producir resultados sorprendentes.

source: Neither need quoting.
es: En ninguno de estos casos hay que usar comillas.

source: Neither of these last two commands will update your working directory, however both will update the remote-tracking branches in your repository.
es: Ninguno de los dos comandos anteriores actualizará el directorio de trabajo. Sin embargo, ambos actualizarán las ramas de seguimiento remoto del repositorio.

source: Nested modules (such as C<File::Basename>) are specified either as C<File::Basename> or C<< File/Basename >>.
es: Los módulos anidados, como C<File::Basename>, se pueden especificar mediante C<File::Basename> o C<< File/Basename >>.

source: Network File System, which allows you to mount a remote filesystem as if it were local.
es: Network File System. Permite montar un sistema de archivos remoto como si fuera local.

source: New files aren't automatically added to your commit when you use C<commit -a> If you want to add files or to commit some, but not all of your changes, have a look at the documentation for C<git add>.)
es: Si se usa C<commit -a>, los archivos nuevos se agregan automáticamente a la confirmación. Si desea agregar archivos o confirmar solo algunos de los cambios, consulte la documentación de C<git add>).

source: Nicholas 5.8.2 2003-Nov-05 10 50 788 5.8.3 2004-Jan-14 31 13 360 5.8.4 2004-Apr-21 33 8 299 5.8.5 2004-Jul-19 11 19 255 5.8.6 2004-Nov-27 35 3 192 5.8.7 2005-May-30 75 34 778 5.8.8 2006-Jan-31 131 42 1251 5.8.9 2008-Dec-14 340 132 12988
es: Nicholas 5.8.2 2003-Nov-05 10 50 788 5.8.3 2004-Ene-14 31 13 360 5.8.4 2004-Abr-21 33 8 299 5.8.5 2004-Jul-19 11 19 255 5.8.6 2004-Nov-27 35 3 192 5.8.7 2005-May-30 75 34 778 5.8.8 2006-Ene-31 131 42 1251 5.8.9 2008-Dic-14 340 132 12988

source: Nicholas 5.8.2-RC1 2003-Oct-27 5.8.2-RC2 2003-Nov-03 5.8.2 2003-Nov-05 5.8.3-RC1 2004-Jan-07 5.8.3 2004-Jan-14 5.8.4-RC1 2004-Apr-05 5.8.4-RC2 2004-Apr-15 5.8.4 2004-Apr-21 5.8.5-RC1 2004-Jul-06 5.8.5-RC2 2004-Jul-08 5.8.5 2004-Jul-19 5.8.6-RC1 2004-Nov-11 5.8.6 2004-Nov-27 5.8.7-RC1 2005-May-18 5.8.7 2005-May-30 5.8.8-RC1 2006-Jan-20 5.8.8 2006-Jan-31 5.8.9-RC1 2008-Nov-10 5.8.9-RC2 2008-Dec-06 5.8.9 2008-Dec-14
es: Nicholas 5.8.2-RC1 2003-Oct-27 5.8.2-RC2 2003-Nov-03 5.8.2 2003-Nov-05 5.8.3-RC1 2004-Ene-07 5.8.3 2004-Ene-14 5.8.4-RC1 2004-Abr-05 5.8.4-RC2 2004-Abr-15 5.8.4 2004-Abr-21 5.8.5-RC1 2004-Jul-06 5.8.5-RC2 2004-Jul-08 5.8.5 2004-Jul-19 5.8.6-RC1 2004-Nov-11 5.8.6 2004-Nov-27 5.8.7-RC1 2005-May-18 5.8.7 2005-May-30 5.8.8-RC1 2006-Ene-20 5.8.8 2006-Ene-31 5.8.9-RC1 2008-Nov-10 5.8.9-RC2 2008-Dic-06 5.8.9 2008-Dic-14

source: Nicholas Clark <nick@ccl4.org>, collating wisdom supplied by Slaven Rezic and Tim Bunce.
es: Nicholas Clark <nick@ccl4.org>, con aportaciones de Slaven Rezic y Tim Bunce.

source: Nicholas Clark created the pluggable interface, refactored Brandon's implementation to work with it, and wrote this document.
es: Nicholas Clark creó la interfaz conectable, refactorizó la implementación de Brandon para trabajar con ella y redactó este documento.

source: Nick 5.003_02 1996-Aug-10
es: Nick 5.003_02 1996-Ago-10

source: No further attempts to find a valid match by advancing the start pointer will occur again.
es: No habrá nuevos intentos para encontrar una coincidencia válida avanzando el puntero de inicio.

source: No hostname given at /usr/local/lib/perl5/site_perl/5.6.0/Net/Acme.pm
es: No se ha especificado un nombre de host en /usr/local/lib/perl5/site_perl/5.6.0/Net/Acme.pm

source: No hostname given at bad_code, line 10.
es: No se ha especificado ningún nombre de host en programa_deficiente, línea 10.

source: No knowledge of XS is necessary.
es: Para ello no tiene que saber cómo funciona XS.

source: No one is actively supporting Perl 4.
es: Actualmente nadie ofrece soporte para Perl 4 de forma activa.

source: No one was allowed to make backups unless they had the "backup pumpkin".
es: Nadie podía hacer una copia de seguridad sin tener en su poder la "calabaza de copia de seguridad".

source: No space before the semicolon.
es: Ningún espacio antes de punto y coma.

source: No space between function name and its opening parenthesis.
es: Ningún espacio entre un nombre de función y su paréntesis de apertura.

source: No such thing.
es: Esto no existe.

source: No, Data::Dumper's Unicode abilities are as they should be.
es: No, el procesamiento de Unicode en Data::Dumper es correcto.

source: No, Perl is easy to start learning--and easy to keep learning.
es: No. Es fácil adquirir los conocimientos básicos; y también lo es seguir aprendiendo.

source: No, and this isn't really a Unicode FAQ.
es: No. Y este documento no contiene preguntas y respuestas sobre Unicode.

source: Nobody else on the planet is going to talk your local data format, so we can ignore that.
es: Nadie más en el planeta va a comunicarse con su formato de datos local, por lo que podemos ignorar esta parte.

source: Nor want it.
es: Ni lo desea.

source: Normal arrays are ordered lists of scalars indexed by number, starting with 0.
es: Los arrays normales son listas ordenadas de escalares indexadas por números, empezando por 0.

source: Normally this only influences efficiency, not semantics.
es: Normalmente, esto solo influye en la eficiencia, no en la semántica.

source: Not a stellar system with three stars, but an L</operator> taking three L<operands|/operand>.
es: No es un sistema estelar con tres estrellas, sino un L</operador> que se aplica a tres L<operandos|/operando>.

source: Not affected by /s modifier
es: No se ve afectado por el modificador /s

source: Not doing so may lead to surprises:
es: De lo contrario pueden producirse sorpresas:

source: Not every class has attributes and methods.
es: No todas las clases tienen atributos y métodos.

source: Not every event or Perl Mongers group is on that calendar, so don't lose heart if you don't see yours posted.
es: No todos los eventos o grupos de Perl Mongers figuran en ese calendario, así que no se desanime si no ve el suyo publicado.

source: Not everything in Perl changes every day.
es: En Perl no todo cambia a diario.

source: Not everything is mentioned, but 195 features may already be overwhelming.
es: No abarca todo, pero incluye 195 características del lenguaje; no es mal comienzo.

source: Not meaning the same thing everywhere.
es: No tiene el mismo significado en todas partes.

source: Not that we'd advise you to use this obfuscation.
es: Le recomendamos que no use este tipo de ofuscación.

source: Not to be confused with L<delimiters|/delimiter> or L<separators|/separator>.
es: No se debe confundir con un L</delimitador> o un L</separador>.

source: Not to be confused with L<delimiters|/delimiter> or L<terminators|/terminator>.
es: No se debe confundir con un L</delimitador> o un L</terminador>.

source: Note however that look-ahead and look-behind are NOT the same thing.
es: Sin embargo, debe tener en cuenta que las inspecciones hacia adelante y hacia atrás NO funcionan igual.

source: Note that simply using
es: Tenga en cuenta que el simple uso de

source: Note that the meanings don't change, just the "greediness": X<metacharacter> X<greedy> X<greediness> X<?> X<*?> X<+?> X<??> X<{n}?> X<{n,}?> X<{n,m}?>
es: Tenga en cuenta que los significados no cambian, solo cambia la "avaricia": X<metacharacter> X<greedy> X<greediness> X<metacarácter> X<avaricioso> X<avaricia> X<?> X<*?> X<+?> X<??> X<{n}?> X<{n,}?> X<{n,m}?>

source: Note that the object passed to C<save()> in this case is still a C object, even though the method is found in the C<File> class.
es: Observe que el objeto pasado a C<guardar()> en este caso sigue siendo un objeto de la clase C, pese a que el método se encuentra en la clase C<Archivo>.

source: Note also that zero-length look-ahead/look-behind assertions will not backtrack to make the tail match, since they are in "logical" context: only whether they match is considered relevant.
es: Tenga en cuenta también que las aserciones de inspección hacia adelante/hacia atrás de longitud cero no darán marcha atrás para que la parte final coincida, ya que están en un contexto "lógico": lo único que importa es si coinciden o no.

source: Note also that the C<p> modifier is special in that its presence anywhere in a pattern has a global effect.
es: También debe tener en cuenta que el modificador C<p> es especial, ya que su presencia en cualquier lugar del patrón tiene un efecto global.

source: Note also that the whole range idea is rather unportable between character sets--and even within character sets they may cause results you probably didn't expect.
es: Tenga en cuenta también que la idea de rango es poco transportable entre juegos de caracteres; e incluso dentro de los mismos juegos de caracteres puede causar resultados probablemente inesperados.

source: Note also the existence of C<sv_catpvf> and C<sv_vcatpvfn>, combining concatenation with formatting.
es: Tenga en cuenta que también están disponibles C<sv_catpvf> y C<sv_vcatpvfn>, que combinan la concatenación con la aplicación de formato.

source: Note how we load the user pragma C<myint> with an empty list C<()> to prevent its C<import> being called.
es: Cargamos el pragma de usuario C<entero> con una lista vacía C<()> para impedir que se llame a su método C<import>.

source: Note however that this is not "breadth-first" searching: All the C<Father> ancestors (except the common ancestor) are searched before any of the C<Mother> ancestors are considered.
es: Observe que no se trata ya del orden de búsqueda en anchura: todos los antecesores de C<Padre> (excepto los antecesores comunes) se usan en la búsqueda antes de buscar en cualquiera de los antecesores de C<Madre>.

source: Note that C<(?=\S)(?<!\S)|(?!\S)(?<=\S)> matches exactly at these positions, so we want to have each C<\Y|> in the place of the more complicated version.
es: Observe que C<(?=\S)(?<!\S)|(?!\S)(?<=\S)> coincide exactamente con esas posiciones, así que lo que queremos es usar C<\Y|> en lugar de esta expresión más complicada.

source: Note that C<END> code blocks are B<not> executed at the end of a string C<eval()>: if any C<END> code blocks are created in a string C<eval()>, they will be executed just as any other C<END> code block of that package in LIFO order just before the interpreter is being exited.
es: Tenga en cuenta que los bloques de código C<END> B<no> se ejecutan al final de una evaluación C<eval()> de cadena: si se crea un bloque C<END> mediante una función C<eval()> de cadena, se ejecutará como cualquier otro bloque C<END> del mismo paquete en orden LIFO, justo antes de que se produzca la salida del intérprete.

source: Note that C<\N> has two meanings.
es: Tenga en cuenta que C<\N> tiene dos significados.

source: Note that C<blessed($thing)> will also return false if C<$thing> has been blessed into a class named "0".
es: Observe que C<blessed($algo)> devolverá falso si se bendijo C<$algo> en una clase llamada "0".

source: Note that GNU's gzip/gunzip is not the same as Info-ZIP's zip/unzip package.
es: Tenga en cuenta que la herramienta gzip/gunzip de GNU no es lo mismo que la herramienta zip/unzip de Info-ZIP.

source: Note that Perl closes the comment as soon as it sees a C<)>, so there is no way to put a literal C<)> in the comment.
es: Tenga en cuenta que Perl cierra el comentario tan pronto como ve un C<)>, por lo que no hay manera de poner un C<)> literal en el comentario.

source: Note that after the match, C<$cnt> returns to the globally introduced value, because the scopes that restrict C<local> operators are unwound.
es: Tenga en cuenta que, después de la coincidencia, C<$cnt> devuelve el valor introducido globalmente, porque los ámbitos que limitan los operadores C<local> se desarman en orden inverso al de creación.

source: Note that capture groups matched inside of recursion are not accessible after the recursion returns, so the extra layer of capturing groups is necessary.
es: Tenga en cuenta que los grupos de captura encontrados dentro de la recursión no son accesibles después del regreso de la recursión, por lo que es necesaria una capa extra de grupos de captura.

source: Note that classes aren't classified exclusively into base classes or derived classes: a class can function as both a derived class and a base class simultaneously, which is kind of classy.
es: Tenga en cuenta que las clases no se clasifican exclusivamente en clases base y clases derivadas: una clase puede funcionar a la vez como clase derivada y como clase base, lo que le da un toque de elegancia.

source: Note that function names are considered more readable with parentheses after their name, that is C<function()>.
es: Tenga en cuenta que los nombres de función se consideran más legibles con los paréntesis a continuación: C<funcion()>.

source: Note that if an initialized scalar variable is used instead the result is different: C<my $fh='zzz'; open($fh, ...)> is equivalent to C<open( *{'zzz'}, ...)>.
es: Tenga en cuenta que si se usa una variable escalar ya inicializada, el resultado es diferente: C<my $archivo='zzz'; open($archivo, ...)> es equivalente a C<open( *{'zzz'}, ...)>.
